app/controllers/admin/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at", "admin") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["email", "test1@gmail.co"], ["password_digest", "$2a$12$u3AqRewm8woADsaF8jABkevsffBmYpLkjQAjb8jLEDrXu4/utyvJ2"], ["updated_at", "2019-12-26 17:56:53.085104"], ["id", 5]]
---
  def update
    @user = User.find(params[:id])

    if @user.update(user_params)