app/controllers/tasks_controller.rb

  def update
    @task.update!(task_params)
---
UPDATE "tasks" SET "description" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["description", "テスト用タスク作成 編集したよー"], ["updated_at", "2019-12-13 19:09:05.147576"], ["id", 1]]

  def create
    @task = current_user.tasks.new(task_params)

    if params[:back].present?
      render :new
      return
    end

    if @task.save
---
INSERT INTO "tasks" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "テスト"], ["description", "a"], ["created_at", "2019-12-21 03:11:54.163947"], ["updated_at", "2019-12-21 03:11:54.163947"]]

  def set_task
    @task = current_user.tasks.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 3], ["LIMIT", 1]]