app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks"
---
  def index
    @q = current_user.tasks.ransack(params[:q])
    @tasks = @q.result(distinct: true).page(params[:page])